m1k35nyd3r/weather_station/sdkconfig.defaults
# Guiffion JC1060P470C - ESP32-P4 (silicon rev v1.0) + 7" 1024x600 JD9165 MIPI-DSI.
# Built against ESP-IDF 5.4.4, matching this board's design era: the on-board
# ESP32-C6 ships with ESP-Hosted slave firmware 0.0.6, and the host component is
# pinned to the same version. IDF 5.4 also defaults to ESP32P4_SELECTS_REV_LESS_V3,
# so the v1.0 silicon needs no chip-revision override (IDF 6.1 does, and getting
# that wrong hangs the bootloader).
#
# Activate the toolchain with:
#   source ~/.espressif/tools/activate_idf_v5.4.4.sh

CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Console. The USB-C that enumerates as /dev/ttyACM* is the P4's USB Serial/JTAG;
# there is no UART bridge on it, so leaving the console on the UART0 default
# makes the bootloader and app silent.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# PSRAM. Values match the vendor's lvgl_demo_v9 defaults for this board.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# app_main runs the whole display bring-up; the 3584-byte default is tight.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Wi-Fi via the on-board ESP32-C6 co-processor over SDIO (ESP-Hosted 0.0.6).
# These are the pre-2.x symbol spellings, which is what 0.0.6 defines.
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_SDIO_HOST_INTERFACE=y
CONFIG_SLAVE_CHIPSET_ESP32C6=y
CONFIG_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_SDIO_GPIO_RESET_SLAVE=54
CONFIG_ESP_SDIO_4_BIT_BUS=y
CONFIG_ESP_SDIO_BUS_WIDTH=4
# 0.0.6 spells this ESP_SDIO_FREQ_<target>; ESP_SDIO_CLOCK_FREQ is derived.
CONFIG_ESP_SDIO_FREQ_ESP32P4=40000
CONFIG_ESP_SDIO_PIN_CMD=19
CONFIG_ESP_SDIO_PIN_CLK=18
CONFIG_ESP_SDIO_PIN_D0=14
CONFIG_ESP_SDIO_PIN_D1=15
CONFIG_ESP_SDIO_PIN_D2=16
CONFIG_ESP_SDIO_PIN_D3=17

# Buffers for the remote Wi-Fi stack.
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=10
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER=y
CONFIG_WIFI_RMT_TX_BUFFER_TYPE=1
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_WIFI_RMT_STATIC_RX_MGMT_BUFFER=y
CONFIG_WIFI_RMT_DYNAMIC_RX_MGMT_BUF=0
CONFIG_WIFI_RMT_RX_MGMT_BUF_NUM_DEF=5
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=6
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=6
CONFIG_WIFI_RMT_NVS_ENABLED=y

# HTTPS to api.open-meteo.com.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# RGB565 throughout, matching the vendor BSP for the JD9165 panel. Must stay in
# step with LCD_COLOR_FMT_RGB565 / bits_per_pixel 16 / LV_COLOR_FORMAT_RGB565.
CONFIG_LV_COLOR_DEPTH_16=y
# PNG radar tiles decode to RGBA8888: 384x384 is ~590KB, far past LVGL's
# built-in 64KB pool. CLIB malloc routes through heap_caps, and with
# SPIRAM_USE_MALLOC anything over MALLOC_ALWAYSINTERNAL lands in PSRAM.
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_LODEPNG=y
# Larger type; the 14px default is unreadable at 1024x600.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_44=y
CONFIG_LV_FONT_MONTSERRAT_48=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
